> (load "q6.scm")
> (prime? 5)
#t
> (prime? 13)
#t
> (prime? 25)
#f
> (prime? 100)
#f
> (prime? 119)
#f
> (prime? 117)
#f
> (prime? 101)
#t
> (sum-primes-squared 3 11) ; 3, 5, 7, 11
204
> (sum-primes-squared 100 120) ; 101, 103, 107, 109, 113
56909
> (product-non-divisible 7) ; 6!
720
> (product-non-divisible 3) ; 2!
2
> (product-non-divisible 5) ; 4!
24
> (product-non-divisible 6) ; 5
5
