> (load "q1.scm")
> (sum-bigger2 1 2 3)
13
> (sum-bigger2 3 1 2)
13
> (sum-bigger2 1 3 2)
13
> (sum-bigger2 2 1 3)
13
> (sum-bigger2 3 2 1)
13
