> (load "q10.scm")
> (deep-reverse '((a b) c (d (e f))))
(((f e) d) c (b a))
> (deep-reverse '(a b c d e f g))
(g f e d c b a)
> (deep-reverse '(1 (2 (3 (4 (5 (6 (7)))) 8) 9) 10))
(10 (9 (8 ((((7) 6) 5) 4) 3) 2) 1)
> (deep-reverse '(((a b)) ((c d))))
(((d c)) ((b a)))
