> (load "q2.scm")
> (evaluate '(2 + ((7 * 5) - 4)))
33
> (evaluate '(1 / 0))
/: division by zero
> (evaluate '((3 + (5 - (4 - 2))) * 2))
12
> (evaluate '(5 / (2 + 4)))
5/6
> (evaluate '(2 * (2 * (2 * (2 * (2 * (2 * (2 * 2))))))))
256
> (evaluate '(1 * (2 * (3 * (4 * (5 * (6 * (7 + 8))))))))
10800
> (evaluate '(8 - (4 * 3)))
-4
